/*
Напишите программу, которая работала бы следующим образом: в prompt вводится значение. С помощью унарного плюса (арифметический оператор) необходимо преобразовать его в число, затем проверить с помощью typeof, принадлежит ли оно к множеству Number.

Если это число, то вывести в консоль чётное оно или нечётное.

Если передано не число, выведите: «Упс, кажется, вы ошиблись».

*NaN, хоть и относится к типу Number, числом не является. Добавьте отдельную проверку для этого значения.
*/
const value = prompt("Введите значение:");

const numberValue = +value;

if (typeof numberValue === 'number') {
    if (isNaN(numberValue)) {
        console.log("Упс, кажется, вы ошиблись");
    } else if (numberValue % 2 === 0) {
        console.log("Чётное число");
    } else {
        console.log("Нечётное число");
    }
} else {
    console.log("Упс, кажется, вы ошиблись");
}